Revit 2027 API
SolidSolidCutUtils.AddCutBetweenSolids Method
Overload List
Name | Description
AddCutBetweenSolids(Document, Element, Element) |  Adds a solid-solid cut for the two elements.
AddCutBetweenSolids(Document, Element, Element, Boolean) |  Adds a solid-solid cut for the two elements with the option to control splitting of faces of the cutting solid.
Top
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace